УТ_для_edt.РасширениеСмарт/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/ФизическиеЛица/Forms/CRM_МодульУТ_ФормаЭлемента/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
//++ #Б-2724 смарт: Фролов 19.03.2025 //Закрыть доступ к видимости личных данных в карточке физического лица
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация");
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	#Вставка
	//++ #Б-2724 смарт: Фролов 19.03.2025 //Закрыть доступ к видимости личных данных в карточке физического лица
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	ПросмотрРазрешен = 
		Объект.Ссылка.Пустая()
		ИЛИ
		Пользователь.смартДоступныДанныеВнутреннихФизическихЛиц
			И Объект.смартВидФизическогоЛица = Перечисления.смартВидыФизическихЛиц.Внутренний
		Или
		Пользователь.смартДоступныДанныеВнешнихФизическихЛиц
			И Объект.смартВидФизическогоЛица = Перечисления.смартВидыФизическихЛиц.Внешний
		//++ #Б-2890 смарт: Фролов 03.04.2025 //Видимость личных данных в карточке физического лица для полных прав
		ИЛИ	Пользователи.ЭтоПолноправныйПользователь();
		//-- #Б-2890 смарт: Фролов 03.04.2025
	
	Если Не ПросмотрРазрешен Тогда 
		
		Элементы.ГруппаКонтактнаяИнформация.Видимость = Ложь;
		Элементы.ГруппаПолИДатаРождения.Видимость = Ложь;
		Элементы.ИНН.Видимость = Ложь;
		Элементы.ДекорацияУточнение.Видимость = Ложь;
		
	Иначе	
		
		смартОбщегоНазначения.ДобавитьПодсказкиКонтактнаяИнформация(ЭтотОбъект);
		
	КонецЕсли;
	
	//++ #1263 смарт: Фролов 01.12.2022 //Служебная записка на списание ПФ (Заказ на внутреннее потребление)  
	НовыйЭлемент = Элементы.Добавить("смартДолжность", Тип("ПолеФормы"),элементы.ГруппаНаименование);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартДолжность";
	НовыйЭлемент.Заголовок = "Должность"; 
	//-- #1263 смарт: Фролов 01.12.2022
	
	//++ #Б-7128 смарт: Фролов 11.06.2026 //Создать печатную форму Служебной Записки
	НовыйЭлемент = Элементы.Добавить("смартТабельныйНомер", Тип("ПолеФормы"),элементы.ГруппаНаименование);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартТабельныйНомер";
	НовыйЭлемент.Заголовок = "Табельный номер";
	//-- #Б-7128 смарт: Фролов 11.06.2026
		
	//-- #Б-2724 смарт: Фролов 19.03.2025	
	#КонецВставки

	// Учесть возможность создания из взаимодействия
	Взаимодействия.ПодготовитьОповещения(ЭтаФорма,Параметры,Ложь);

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ПравоДоступа("Изменение", Метаданные.Справочники.ФизическиеЛица) Тогда
		УправлениеДоступом.ПриСозданииФормыЗначенияДоступа(ЭтаФорма);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	УстановитьСвойстваГиперссылкиИсторииФИО(Объект, Элементы, НаборЗаписейФИОФизЛиц.Количество());

	// +CRM
	CRM_МетодыФормСправочниковСервер.ФизическиеЛицаФормаЭлементаПриСозданииНаСервере(ЭтотОбъект, Объект);
	// -CRM
КонецПроцедуры //-- #Б-2724 смарт: Фролов 19.03.2025

#КонецОбласти
